{"keras_version": "1.2.1", "config": [{"config": {"name": "convolution2d_1", "border_mode": "valid", "bias": true, "nb_row": 5, "nb_filter": 24, "b_regularizer": null, "W_regularizer": null, "batch_input_shape": [null, 160, 80, 3], "W_constraint": null, "b_constraint": null, "input_dtype": "float32", "nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_2", "border_mode": "valid", "bias": true, "nb_row": 5, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_1", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_3", "border_mode": "valid", "bias": true, "nb_row": 5, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_2", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_4", "border_mode": "valid", "bias": true, "nb_row": 3, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [1, 1], "trainable": true, "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_3", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_5", "border_mode": "valid", "bias": true, "nb_row": 3, "nb_filter": 72, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_4", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [1, 1], "trainable": true, "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_4", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_6", "border_mode": "valid", "bias": true, "nb_row": 2, "nb_filter": 84, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 2, "activity_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_5", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [1, 1], "trainable": true, "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_5", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": 924, "name": "dense_1", "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 100, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 100, "name": "dense_2", "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 50, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 50, "name": "dense_3", "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 10, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 10, "name": "dense_4", "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 1, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}