{"config": [{"config": {"nb_filter": 24, "subsample": [2, 2], "dim_ordering": "tf", "batch_input_shape": [null, 160, 80, 3], "border_mode": "valid", "activation": "relu", "nb_col": 5, "name": "convolution2d_1", "trainable": true, "b_constraint": null, "input_dtype": "float32", "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 36, "subsample": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "nb_col": 5, "name": "convolution2d_2", "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"nb_filter": 48, "subsample": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "nb_col": 5, "name": "convolution2d_3", "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"nb_filter": 64, "subsample": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "nb_col": 3, "name": "convolution2d_4", "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [1, 1], "name": "maxpooling2d_3", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"nb_filter": 72, "subsample": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "nb_col": 3, "name": "convolution2d_5", "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "W_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [1, 1], "name": "maxpooling2d_4", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"nb_filter": 84, "subsample": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "nb_col": 2, "name": "convolution2d_6", "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 2, "W_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [1, 1], "name": "maxpooling2d_5", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "input_dim": 924, "activation": "linear", "output_dim": 100, "name": "dense_1", "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "input_dim": 100, "activation": "linear", "output_dim": 50, "name": "dense_2", "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_7", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "input_dim": 50, "activation": "linear", "output_dim": 10, "name": "dense_3", "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_8", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "input_dim": 10, "activation": "linear", "output_dim": 1, "name": "dense_4", "trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}